app/controllers/tasks_controller.rb

  def create
    @task = @user.tasks.new(task_params)

    if @task.save
---
INSERT INTO `tasks` (`title`, `description`, `priority`, `status`, `user_id`, `created_at`, `updated_at`) VALUES ('Check mail', 'Just regular tasks', 2, 0, 1, '2023-04-18 23:55:14.174755', '2023-04-18 23:55:14.174755')

  def update
    if @task.update(task_params)
---
UPDATE `tasks` SET `tasks`.`priority` = 1, `tasks`.`updated_at` = '2023-04-18 23:56:34.650117' WHERE `tasks`.`id` = 2

  def destroy
    @task.destroy
---
DELETE FROM `tasks` WHERE `tasks`.`id` = 2

    def set_user
      @user = User.find(params[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

    def set_task
      @task = @user.tasks.find(params[:id])
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 1 AND `tasks`.`id` = 2 LIMIT 1